In [14]:
import mysql.connector
import pandas as pd
import datetime

In [15]:
mydb = mysql.connector.connect(
    host = "localhost",
    user = "root",
    passwd = "Blueb@nd99",
    database = "sakila"

)

In [ ]:
#======================= NO 1

In [16]:
mycursor = mydb.cursor()
query = "select film.title As Title ,category.name As Category ,min(film.length) As Length  from film join film_category using(film_id) join category using (category_id) where category.name = 'Comedy' group by Title Order by Length limit 10"

mycursor.execute(query)
myresult = mycursor.fetchall()
columns = mycursor.column_names
df = pd.DataFrame(myresult, columns=columns)
df

              Title Category  Length
0   DOWNHILL ENOUGH   Comedy      47
1  PARADISE SABRINA   Comedy      48
2    HEAVEN FREEDOM   Comedy      48
3  HURRICANE AFFAIR   Comedy      49
4        LION UNCUT   Comedy      50
5         ZORRO ARK   Comedy      50
6       CLOSER BANG   Comedy      58
7   AIRPLANE SIERRA   Comedy      62
8   LONELY ELEPHANT   Comedy      67
9      DOOM DANCING   Comedy      68

In [ ]:
#===========================  NO 2

In [18]:
mycursor = mydb.cursor()
query = "SELECT category.name as Category, COUNT(Distinct film.title) as jumlahMovie, AVG(payment.amount) as rataHargaSewa FROM category join film_category using(category_id) join film using (film_id) join inventory using (film_id) join rental using (inventory_id) join payment using (rental_id) group by Category Order by jumlahMovie desc"

mycursor.execute(query)
myresult = mycursor.fetchall()
columns = mycursor.column_names
df = pd.DataFrame(myresult, columns=columns)
df

       Category  jumlahMovie rataHargaSewa
0        Sports           73      4.507388
1        Family           67      3.855903
2       Foreign           67      4.134240
3     Animation           64      3.993396
4   Documentary           63      4.016686
5        Action           61      3.935117
6         Drama           61      4.327726
7           New           60      4.629383
8        Sci-Fi           59      4.320599
9      Children           58      3.868307
10        Games           58      4.418297
11       Comedy           56      4.658427
12     Classics           54      3.876028
13       Horror           53      4.400165
14       Travel           53      4.240908
15        Music           51      4.117735

In [ ]:
#============================= NO 3

In [10]:
mycursor = mydb.cursor()
query = "select actor.actor_id As Actor_id, actor.first_name As first_Name, actor.last_name As Last_name, count(film.title) As JumlahMovie from actor join film_actor using(actor_id) join film using (film_id) group by Actor_id order by JumlahMovie desc limit 10"

mycursor.execute(query)
myresult = mycursor.fetchall()
columns = mycursor.column_names
df = pd.DataFrame(myresult, columns=columns)
df

   Actor_id first_Name  Last_name  JumlahMovie
0       107       GINA  DEGENERES           42
1       102     WALTER       TORN           41
2       198       MARY     KEITEL           40
3       181    MATTHEW     CARREY           39
4        23     SANDRA     KILMER           37
5        81   SCARLETT      DAMON           36
6        37        VAL     BOLGER           35
7       158     VIVIEN   BASINGER           35
8       106    GROUCHO      DUNST           35
9        13        UMA       WOOD           35

In [ ]:
#==================================== NO 4

In [19]:
mycursor = mydb.cursor()
query = "select category.name As category, count(film.title) As jumlahmovies from category join film_category using (category_id) join film using(film_id) join film_actor using (film_id) join actor using (actor_id) where actor_id=107  group by category order by jumlahmovies desc;"

mycursor.execute(query)
myresult = mycursor.fetchall()
columns = mycursor.column_names
df = pd.DataFrame(myresult, columns=columns)
df

       category  jumlahmovies
0        Sci-Fi             7
1         Music             4
2     Animation             4
3        Family             4
4   Documentary             3
5        Action             3
6        Comedy             3
7       Foreign             2
8         Drama             2
9      Children             2
10     Classics             2
11       Sports             2
12          New             1
13       Horror             1
14        Games             1
15       Travel             1

In [ ]:
#==================================== NO 5

In [20]:
mycursor = mydb.cursor()
query = "select film.title As Title, category.name As category from category join film_category using (category_id) join film using(film_id) join film_actor using (film_id) join actor using (actor_id) where actor_id=107 and  category_id=14"

mycursor.execute(query)
myresult = mycursor.fetchall()
columns = mycursor.column_names
df = pd.DataFrame(myresult, columns=columns)
df

                 Title category
0  CHARIOTS CONSPIRACY   Sci-Fi
1  COLDBLOODED DARLING   Sci-Fi
2       FRISCO FORREST   Sci-Fi
3    GOODFELLAS SALUTE   Sci-Fi
4      LICENSE WEEKEND   Sci-Fi
5         OPEN AFRICAN   Sci-Fi
6  SPIRITED CASUALTIES   Sci-Fi

In [ ]:
select film.title As Title, category.name As category from category join film_category using (category_id) join film using(film_id) join film_actor using (film_id) join actor using (actor_id) where actor_id=107 and  category_id=14